{
  "posts": [
    {
      "title": "AWS re:Invent",
      "author": "Tristan Setha",
      "date": "2023-10-23",
      "header_image": "/aws-reinvent.jpg",
      "preview_content": "At EAS I had the opportunity to work alongside a team of designers, project managers, and other engineers to develop an online personality test platform for the AWS Reinvent event.",
      "tags": [
        "project"
      ],
      "post_content": [
        {
          "type": "p",
          "header": "Introduction",
          "header_type": "h2",
          "element_content": "At EAS I had the opportunity to work alongside a team of designers, project managers, and other engineers to develop an online personality test platform for the AWS Reinvent event."
        },
        {
          "type": "p",
          "header": "Project Goal",
          "header_type": "h2",
          "element_content": "Develop a new website and an experience for the AWS re:Invent Superhero Personality Test — a seven-question interactive quiz designed to determine which superhero a user aligns with the most. The project will be showcased at the re:Invent 2023 event in collaboration with AWS Analytics."
        },
        {
          "type": "p",
          "element_content": "The quiz will determine which Hero (Cloud Sight, Wire Weaver, Data Lynx) the user most identifies with based on 7 questions. Each question assigns points to one or more hero alignments. At the end, the user gets matched with the hero with the highest score."
        },
        {
          "type": "table",
          "table_header": [
            "Theme(s)",
            "Hero"
          ],
          "table_rows": [
            [
              "Zero ETL & Integrations, Accelerating innovation",
              "Wire Weaver"
            ],
            [
              "Modern governance, Operational efficiency",
              "Data Lynx"
            ],
            [
              "Analytics and AI",
              "Cloud Sight"
            ]
          ],
          "image": "",
          "element_content": "Each hero is associated with one or more themes, providing users with recommended sessions to attend during the event."
        },
        {
          "type": "p",
          "header": "Design and Development Process:",
          "header_type": "h2",
          "element_content": "The website was developed using EAS’s internal tooling, which incorporates Gulp.js, PHP, Node.js, Sass, the GreenSock Animation Library, and HTML5 Web Components."
        },
        {
          "type": "p",
          "element_content": "We approached the development process from a data-driven approach to facilitate easy client updates. This involved decoupling data such as hero names, assets, questions, and points from code, which underwent frequent changes during the development process. To achieve this flexibility, we stored data using JSON and CSV files, converting the latter into JSON through scripts."
        }
      ]
    }
  ]
}